<a href="https://colab.research.google.com/github/deepasoman93/Python_ML_Basics/blob/main/GO_STP_7389_Assignment_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment-10 Pandas Dummy Variables and One-hot encoding sklearn

Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?

Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

Dataset Link- https://data.princeton.edu/wws509/datasets/salary.dat

1. OneHotEncoding

OneHotEncoding is a prpcess to convert string data into numeric data, but data should be categorical value.
The input to the transformer should be an array like of integers or string, denoting the value takenby categorical feature. This creates a binary columns and returns the spars matrix or dense array.

2. Multicollinearity

It is a phenomenon in which one predictor variable in a multiple regression model can be linearly predicted from the others with accuracy.
It neither reduce the predictive power nor reliablility of the model as whole, at least within the sample data set; it only affects calculations regarding individual predictors

3. Dummy Variable

It is a scenario where there are attributes which are highly correlated and one varable predicts the value of others. When we use one hot encoding for handling the categorical data, then one attribute can be predicted with the help of other dummy variables.
For example, Sex having two values male and female. Either they can be 1/0 or 0/1. Including both dummy variable can cause redundancy because if a person is not male in such case the person is female, hence, we don't need to use both the variables in model.

4. Nominal Variable vs Ordinal Variable

Nominal data is a group of non-parametric variables, while Ordinal data is a group of non-parametric ordered variables.

Nominal data: Gender, race, eye colour
Ordinal data: Height, weight, mark(numerical only)

In [8]:
from sklearn.preprocessing import LabelEncoder
import pandas as pd

In [2]:
url = "https://data.princeton.edu/wws509/datasets/salary.dat"
data = pd.read_csv(url, delim_whitespace = True)

In [4]:
data.head(10)

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696
5    male  full  16  doctorate  21  28516
6  female  full   0    masters  32  24900
7    male  full  16  doctorate  18  31909
8    male  full  13    masters  30  31850
9    male  full  13    masters  31  32850

In [3]:
data.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [7]:
data.isnull().sum()

sx    0
rk    0
yr    0
dg    0
yd    0
sl    0
dtype: int64

In [6]:
data.corr()

          yr        yd        sl
yr  1.000000  0.638776  0.700669
yd  0.638776  1.000000  0.674854
sl  0.700669  0.674854  1.000000

In [12]:
L = LabelEncoder()
data.sx = L.fit_transform(data.sx)
data["sx"]

0     1
1     1
2     1
3     0
4     1
5     1
6     0
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
15    1
16    1
17    1
18    1
19    1
20    1
21    1
22    1
23    0
24    1
25    1
26    1
27    0
28    1
29    1
30    0
31    1
32    1
33    0
34    0
35    1
36    0
37    1
38    1
39    1
40    1
41    1
42    1
43    0
44    1
45    1
46    0
47    0
48    1
49    0
50    0
51    0
Name: sx, dtype: int64

In [15]:
dat = data['sx'].value_counts()
dat

1    38
0    14
Name: sx, dtype: int64

In [13]:
data.rk = L.fit_transform(data.rk)
data["rk"]

0     2
1     2
2     2
3     2
4     2
5     2
6     2
7     2
8     2
9     2
10    2
11    1
12    2
13    1
14    2
15    2
16    2
17    1
18    1
19    2
20    0
21    1
22    2
23    2
24    1
25    2
26    1
27    2
28    1
29    1
30    0
31    1
32    0
33    1
34    1
35    1
36    0
37    0
38    0
39    0
40    0
41    0
42    1
43    0
44    0
45    0
46    0
47    0
48    0
49    0
50    0
51    0
Name: rk, dtype: int64

In [16]:
dat = data['rk'].value_counts()
dat

2    20
0    18
1    14
Name: rk, dtype: int64

In [14]:
data.dg = L.fit_transform(data.dg)
data["dg"]

0     0
1     0
2     0
3     0
4     1
5     0
6     1
7     0
8     1
9     1
10    0
11    0
12    0
13    1
14    0
15    0
16    0
17    1
18    1
19    1
20    1
21    1
22    0
23    0
24    0
25    0
26    0
27    0
28    1
29    1
30    1
31    1
32    1
33    1
34    1
35    0
36    0
37    0
38    0
39    0
40    0
41    1
42    0
43    0
44    0
45    0
46    0
47    0
48    0
49    0
50    0
51    0
Name: dg, dtype: int64

In [17]:
dat = data['dg'].value_counts()
dat

0    34
1    18
Name: dg, dtype: int64